# 0，1，2，3，4，5，6，7，8，9

import random

def shuffle(n):
    a = [x for x in range(n)]  # 初始值
    print(a)
    print('-'*30)
    for i in range(len(a)-1, 0, -1):  # 从最后一张牌开始循环抽取
        k = random.randint(0, i)  # 随机抽取一张牌
        a[i], a[k] = a[k], a[i]   # 两张牌交换位置
        print(a)
    return a
print(shuffle(10))

# [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]
# ------------------------------
# [0, 1, 2, 9, 4, 5, 6, 7, 8, 3]
# [0, 1, 8, 9, 4, 5, 6, 7, 2, 3]
# [0, 7, 8, 9, 4, 5, 6, 1, 2, 3]
# [6, 7, 8, 9, 4, 5, 0, 1, 2, 3]
# [6, 7, 8, 5, 4, 9, 0, 1, 2, 3]
# [6, 4, 8, 5, 7, 9, 0, 1, 2, 3]
# [6, 4, 8, 5, 7, 9, 0, 1, 2, 3]
# [6, 4, 8, 5, 7, 9, 0, 1, 2, 3]
# [4, 6, 8, 5, 7, 9, 0, 1, 2, 3]
# [4, 6, 8, 5, 7, 9, 0, 1, 2, 3]

# python自带的洗牌算法
# import random
# l= [1,2,3,4,5,6,7,8,9]
# random.shuffle(l)
# l
