# _*_ coding: utf-8 _*_
__author__ = 'bobby'
__data__ = '2017/6/7 16:14 '

#如果某个数的平方的末尾几位等于这个数，那么这个数为自守数,显然5,6,25,76都是自守数
#eg: 5*5=25 , 6*6=36， 25*25=625，76*76=5776
#求10000以内的自守数
"""
解题思路：1、计算n的长度l  2、取n*n的后l位t  3、n==t?
"""
#计算任意一个数的位数len(str(n))
#或者
# n = 2345
# count  = 0
# while n > 0:
#     count +=1
#     n = int(n/10)
# count

#取一个数的后3位 n%1000求余

###############################################
# for n in range(1,10000):
#     l = len(str(n))
#     t = n*n % (10**l)#取后l位
#     if t == n:
#         print(n)


#用一行列表解析代码，就能完成功能
print([n for n in range(1,10000) if n*n % (10**len(str(n))) == n])

